{
  "architectures": [
    "EomtDinov3ForUniversalSegmentation"
  ],
  "attention_dropout": 0.0,
  "class_weight": 2.0,
  "dice_weight": 5.0,
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "background",
    "1": "plastic"
  },
  "image_size": 512,
  "importance_sample_ratio": 0.75,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "key_bias": false,
  "label2id": {
    "background": 0,
    "plastic": 1
  },
  "layer_norm_eps": 1e-05,
  "layerscale_value": 1.0,
  "mask_weight": 5.0,
  "mlp_bias": true,
  "model_type": "eomt_dinov3",
  "no_object_weight": 0.1,
  "num_attention_heads": 16,
  "num_blocks": 4,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "num_queries": 100,
  "num_register_tokens": 4,
  "num_upscale_blocks": 2,
  "oversample_ratio": 3.0,
  "patch_size": 16,
  "pos_embed_jitter": null,
  "pos_embed_rescale": 2.0,
  "pos_embed_shift": null,
  "proj_bias": true,
  "query_bias": true,
  "rope_parameters": {
    "rope_theta": 100.0,
    "rope_type": "default"
  },
  "train_num_points": 12544,
  "transformers_version": "5.8.1",
  "use_gated_mlp": false,
  "value_bias": true
}
